Revit 2027 API
AssetProperty.Name Property
Get the name of the AssetProperty
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; }
Public ReadOnly Property Name As String
	Get
public:
property String^ Name {
	String^ get ();
}
member Name : string with get
Property Value
String
See Also
Reference
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace